# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
def Summ_num(list):
    sum = 0
    for i in range(1,len(list),2):
        sum+=list[i]
    return sum

num_list = [2, 3, 5, 9, 3]
result = Summ_num(num_list)
print('{} : Сумма элементов на нечётных позициях'.format(result))